In [1]:
# The following piece of code gives the opportunity to show multiple outputs
# in one cell:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

## Generating Dataframe

Note that the funcion `pandas.Series()` produces 0ne-dimensional ndarray with axis labels (including time series).

In [14]:
import pandas as pd
import numpy as np

#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])}

#Create a DataFrame
df = pd.DataFrame(d)
df
df.describe()

      Name  Age  Rating
0      Tom   25    4.23
1    James   26    3.24
2    Ricky   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    Smith   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65

             Age     Rating
count  12.000000  12.000000
mean   31.833333   3.743333
std     9.232682   0.661628
min    23.000000   2.560000
25%    25.000000   3.230000
50%    29.500000   3.790000
75%    35.500000   4.132500
max    51.000000   4.800000

## Summation
Returns the sum of the values for the requested axis. By default, axis is index (axis=0).

In [7]:
df.sum()
df.sum(1)

Name      TomJamesRickyVinSteveSmithJackLeeDavidGasperBe...
Age                                                     382
Rating                                                44.92
dtype: object

0     29.23
1     29.24
2     28.98
3     25.56
4     33.20
5     33.60
6     26.80
7     37.78
8     42.98
9     34.80
10    55.10
11    49.65
dtype: float64

## Mean

In [15]:
df.mean()
df.mean(1)

Age       31.833333
Rating     3.743333
dtype: float64

0     14.615
1     14.620
2     14.490
3     12.780
4     16.600
5     16.800
6     13.400
7     18.890
8     21.490
9     17.400
10    27.550
11    24.825
dtype: float64

## Standard Deviation

In [9]:
df.std()

Age       9.232682
Rating    0.661628
dtype: float64

# Functions & Description
Let us now understand the functions under Descriptive Statistics in Python Pandas. The following table list down the important functions

+ 1  `count()`	Number of non-null observations
+ 2	 `sum()`	Sum of values
+ 3	 `mean()`	Mean of Values
+ 4	 `median()`	Median of Values
+ 5	 `mode()`	Mode of values
+ 6	 `std()`	Standard Deviation of the Values
+ 7	 `min()`	Minimum Value
+ 8	 `max()`	Maximum Value
+ 9	 `abs()`	Absolute Value
+ 10 `prod()`	Product of Values
+ 11 `cumsum()`	Cumulative Sum
+ 12 `cumprod()`	Cumulative Product
Note − Since DataFrame is a Heterogeneous data structure. Generic operations don’t work with all functions.

Functions like `sum()`, `cumsum()` work with both numeric and character (or) string data elements without any error. Though n practice, character aggregations are never used generally, these functions do not throw any exception.



Functions like `abs()`, `cumprod()` throw exception when the DataFrame contains character or string data because such operations cannot be performed.

In [10]:
df.describe(include=['object'])

         Name
count      12
unique     12
top     Smith
freq        1

In [11]:
df. describe(include='all')

         Name        Age     Rating
count      12  12.000000  12.000000
unique     12        NaN        NaN
top     Smith        NaN        NaN
freq        1        NaN        NaN
mean      NaN  31.833333   3.743333
std       NaN   9.232682   0.661628
min       NaN  23.000000   2.560000
25%       NaN  25.000000   3.230000
50%       NaN  29.500000   3.790000
75%       NaN  35.500000   4.132500
max       NaN  51.000000   4.800000